Revit 2026 API

# ExternalApplicationArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalApplicationArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ExternalApplicationArrayIterator()
```
```fsharp
new : unit -> ExternalApplicationArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ExternalApplicationArrayIterator Class

Autodesk.Revit.UI Namespace